DataProcessors/мегапрайсРабочийСтол.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<DataProcessor>
		<Properties>
			<Name>мегапрайсРабочийСтол</Name>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>МониторПрайсов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пометка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Статус</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПрофильПрайса</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.мегапрайсПрофилиПрайсов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИспользоватьРегламентноеЗадание</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаданиеВремяНачало</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФайлКаталогНаЛокальномДиске</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторПрайса</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/мегапрайсЦеныНоменклатурыПоставщиков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<InformationRegister>
		<Properties>
			<Name>мегапрайсЦеныНоменклатурыПоставщиков</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЦенаПродажи</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МинимальныйЗаказ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокПоставки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ПрайсПартнера</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.мегапрайсПрофилиПрайсов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НоменклатураПоставщика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НоменклатураПоставщиков</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Поле_Артикул</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Поле_Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Поле_Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Производитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Производители</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КлючСтроки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

DataProcessors/мегапрайсРабочийСтол/Forms/Форма/Ext/Form/Module.bsl
//============================================================================
 // АВТОР
  
 &НаКлиенте
 Процедура SubSysSkype(Команда)
	 
	 ЗапуститьПриложение("skype:shekineugeniy?chat");
	 
 КонецПроцедуры
  
 &НаКлиенте
 Процедура SubSysПерейтиНаСайтРазработчика(Команда)
	 
	 ЗапуститьПриложение("http://subsystems.ru/");
	 
 КонецПроцедуры
 
 &НаКлиенте
 Процедура SubSysПроверитьОбновления(Команда)
	 
	 ЗапуститьПриложение("http://subsystems.ru/news/");
	 
 КонецПроцедуры
 
 
&НаКлиенте
Процедура ВидеоОбзор(Команда)
	
	ЗапуститьПриложение("https://www.youtube.com/channel/UCTukH6iP4DSW0LtdKBRfUlw");
	
КонецПроцедуры

//============================================================================

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

КонецПроцедуры

&НаКлиенте
 Процедура ПриОткрытии(Отказ)
	 
	 ОбновитьМониторПрайсов()

 КонецПроцедуры

 //============================================================================
 // МОНИТОР
 
 &НаКлиенте
 Процедура ОбновитьДанныеРабочегоСтола()
	 
	 Элементы.РегистрацияПрайсов.Обновить();

 КонецПроцедуры
 
&НаКлиенте
Процедура КомандаОбновитьМонитор(Команда)
	
	Объект.МониторПрайсов.Очистить();
	
	ОбновитьМониторПрайсов();	
	ОбновитьДанныеРабочегоСтола();
	
КонецПроцедуры

&НаСервере
Функция ПроверитьКаталог(ПрофильПрайса,ФайлКаталогНаЛокальномДиске,ИдентификаторПрайсаСтарый)
	
	ТекстОповещения = "";
	
	ПутьККаталогу = ФайлКаталогНаЛокальномДиске;
	Если НЕ ЗначениеЗаполнено(ПутьККаталогу) Тогда
		Возврат "Ошибка в профиле - не указан каталог";
	КонецЕсли;	
	//КаталогНаДиске = Новый Файл(ПутьККаталогу);
	//Если Не КаталогНаДиске.Существует() Тогда
	//	Возврат "Ошибка в профиле - путь";
	//КонецЕсли;	

	СписокФайлов = Новый СписокЗначений;
	
	Если ПрофильПрайса.ФайлВидРасположения = "НаЛокальномДиске" Тогда
		НайденныеФайлы = НайтиФайлы(ПутьККаталогу, "**.xls"); 	
		Для Каждого ИмяФайла Из НайденныеФайлы Цикл
			СписокФайлов.Добавить(ИмяФайла.ПолноеИмя);
		КонецЦикла;
		НайденныеФайлы = НайтиФайлы(ПутьККаталогу, "*.xlsx"); 	
		Для Каждого ИмяФайла Из НайденныеФайлы Цикл
			СписокФайлов.Добавить(ИмяФайла.ПолноеИмя);
		КонецЦикла;
		НайденныеФайлы = НайтиФайлы(ПутьККаталогу, "*.xlsm"); 	
		Для Каждого ИмяФайла Из НайденныеФайлы Цикл
			СписокФайлов.Добавить(ИмяФайла.ПолноеИмя);
		КонецЦикла;
		НайденныеФайлы = НайтиФайлы(ПутьККаталогу, "*.ODS"); 	
		Для Каждого ИмяФайла Из НайденныеФайлы Цикл
			СписокФайлов.Добавить(ИмяФайла.ПолноеИмя);
		КонецЦикла;
		НайденныеФайлы = НайтиФайлы(ПутьККаталогу, "*.CSV"); 	
		Для Каждого ИмяФайла Из НайденныеФайлы Цикл
			СписокФайлов.Добавить(ИмяФайла.ПолноеИмя);
		КонецЦикла;	
		
		// Если в каталоге обнаружены файлы	
		Если СписокФайлов.Количество() = 0 Тогда
			//Возврат;
		КонецЕсли;	
		
		Для Каждого ИмяФайла Из СписокФайлов Цикл
			ФайлПутьКФайлу = ИмяФайла.Значение;		
			//ПРОВЕРКА НОВОГО ФАЙЛА
			ФайлНаДиске         = Новый Файл(ФайлПутьКФайлу);
			ИмяФайла            = ФайлНаДиске.Имя;
			ВремяИзмененияФайла = ФайлНаДиске.ПолучитьВремяИзменения();
			РазмерФайла         = ФайлНаДиске.Размер();
			ИдентификаторПрайса = ""+РазмерФайла+"/"+ВремяИзмененияФайла;
			
			ФайлМаска = ПрофильПрайса.ФайлМаска;
			Если ЗначениеЗаполнено(ФайлМаска) И Найти(ИмяФайла,ФайлМаска) = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			Если Найти(ИмяФайла,"загружен") > 0 Тогда
				ТекстОповещения = "Загружен";
				Продолжить;
			КонецЕсли;
			
			Если ИдентификаторПрайсаСтарый = ИдентификаторПрайса Тогда
				ТекстОповещения = "";
			Иначе
				ТекстОповещения = "Есть новый файл!";
			КонецЕсли;						
		КонецЦикла;	
	КонецЕсли;

	
	Возврат ТекстОповещения;
	
КонецФункции

&НаСервере
Процедура ОбновитьМониторПрайсов()
	
	Объект.МониторПрайсов.Очистить();
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	мегапрайсПрофилиПрайсов.Ссылка КАК ПрофильПрайса,
	|	мегапрайсПрофилиПрайсов.ИдентификаторПрайса КАК ИдентификаторПрайса,
	|	мегапрайсПрофилиПрайсов.ИспользоватьРегламентноеЗадание КАК ИспользоватьРегламентноеЗадание,
	|	мегапрайсПрофилиПрайсов.ЗаданиеВремяНачало КАК ЗаданиеВремяНачало,
	|	мегапрайсПрофилиПрайсов.ФайлКаталогНаЛокальномДиске КАК ФайлКаталогНаЛокальномДиске,
	|	мегапрайсПрофилиПрайсов.ФайлПутьКФайлу КАК ФайлПутьКФайлу,
	|	мегапрайсПрофилиПрайсов.Приоритет КАК Приоритет
	|ИЗ
	|	Справочник.мегапрайсПрофилиПрайсов КАК мегапрайсПрофилиПрайсов
	|
	|УПОРЯДОЧИТЬ ПО
	|	Приоритет УБЫВ,
	|	мегапрайсПрофилиПрайсов.ЗаданиеВремяНачало";
	
	Запрос = Новый Запрос();
	Запрос.Текст = ТекстЗапроса;
	Результат = Запрос.Выполнить();
	
	ТекущаяДата = Текущаядата();

	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		Строка = Объект.МониторПрайсов.Добавить();
		ЗаполнитьЗначенияСвойств(Строка,Выборка);	
		
		СтатусВыполнения = "В ожидании";
		
		ПолучитьСтатус = ПроверитьКаталог(Выборка.ПрофильПрайса,Выборка.ФайлКаталогНаЛокальномДиске,Выборка.ИдентификаторПрайса);
		СтатусВыполнения = ?(ПолучитьСтатус="",СтатусВыполнения,ПолучитьСтатус);

		Если СтатусВыполнения = "" Тогда
			ТекущееВремя =  Дата('00010101') + (ТекущаяДата-НачалоДня(ТекущаяДата));
			ЗаданиеВремяНачало = Выборка.ЗаданиеВремяНачало;
			
			Разница = ЗаданиеВремяНачало - ТекущееВремя; 
			Если Разница > 0 Тогда
				СтатусВыполнения = "Назначено время";
			КонецЕсли;
		КонецЕсли;
		
		Строка.Статус = СтатусВыполнения;
		
	КонецЦикла;	
	
КонецПроцедуры


//============================================================================
//============================================================================
//============================================================================

&НаКлиенте
Процедура ЗапуститьРобота(Команда)
	
	ПоказатьВопрос(Новый ОписаниеОповещения("ЗапуститьРоботаЗавершение", ЭтотОбъект), НСтр("ru = 'Вы уверены?'"), РежимДиалогаВопрос.ДаНет);		
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапуститьРоботаЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	 Если РезультатВопроса = КодВозвратаДиалога.Нет Тогда
		 Возврат;
	 КонецЕсли;	

	МегапрайсРобот.мегапрайсИмпортЗагрузкаПрайсов();
	
	ОбновитьМониторПрайсов();	
	ОбновитьДанныеРабочегоСтола();
	
	Состояние("Завершено");
	
КонецПроцедуры


&НаКлиенте
Процедура КомандаОткрытьЗагрузку(Команда)
	
	Если Элементы.Область.ТекущаяСтраница = Элементы.Область.ПодчиненныеЭлементы.РабочийСтол Тогда
		ТекущиеДанные = Элементы.МониторПрайсов.ТекущиеДанные;
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("ПрайсПартнера", ТекущиеДанные.ПрофильПрайса);	
	Иначе
		ТекущиеДанные = Элементы.СписокПрофилиПрайсов.ТекущиеДанные;
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("ПрайсПартнера", ТекущиеДанные.Ссылка);		
	КонецЕсли;
	
	ОткрытьФорму("Обработка.мегапрайсРасширеннаяЗагрузкаИзExcel.Форма.Форма",СтруктураПараметров,ЭтаФорма);

КонецПроцедуры



&НаСервереБезКонтекста
Процедура СформироватьВиртуальныеОстаткиНаСервере()
			
	ОбработкаВыполнения = Обработки.мегапрайсГенерацияОстатковПоставщиков.Создать();
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	мегапрайсПрофилиПрайсов.ВиртуальныйСкладПоставщика КАК ВиртуальныйСкладПоставщика
	|ИЗ
	|	Справочник.мегапрайсПрофилиПрайсов КАК мегапрайсПрофилиПрайсов
	|ГДЕ
	|	мегапрайсПрофилиПрайсов.ПометкаУдаления = ЛОЖЬ";
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		ОбработкаВыполнения.ГенерацияОстатковПоставщиковНаВиртуальныйСклад(Выборка.ВиртуальныйСкладПоставщика);		
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура СформироватьВиртуальныеОстатки(Команда)
	
	СформироватьВиртуальныеОстаткиНаСервере();
	
КонецПроцедуры


&НаКлиенте
Процедура ОткрытьФоновыеЗадания(Команда)
	
	ОткрытьФорму("Обработка.РегламентныеИФоновыеЗадания.Форма.РегламентныеИФоновыеЗадания");
	
КонецПроцедуры


&НаСервере
Процедура УдалитьДанныеПрайсаНаСервере(ПрайсПартнера)
	
	НаборЗаписей = РегистрыСведений.мегапрайсЦеныНоменклатурыПоставщиков.СоздатьНаборЗаписей(); 
	НаборЗаписей.Отбор.ПрайсПартнера.Установить(ПрайсПартнера);
	НаборЗаписей.Записать(Истина);

КонецПроцедуры

&НаКлиенте
Процедура УдалитьДанныеПрайса(Команда)
	
	#Если Клиент Тогда
		 Ответ = Вопрос("Вы уверены что хотите удалить все данные?", РежимДиалогаВопрос.ДаНет, ,КодВозвратаДиалога.Нет, "Дополнительный вопрос");		
		 Если Ответ <> КодВозвратаДиалога.Да Тогда
			 Возврат;
		 КонецЕсли;
	 #КонецЕсли

	ТекущиеДанные = Элементы.СписокПрофилиПрайсов.ТекущиеДанные;

	УдалитьДанныеПрайсаНаСервере(ТекущиеДанные.Ссылка);
	
КонецПроцедуры


















&НаКлиенте
Процедура ОткрытьПомощникПродаж(Команда)
	
	ОткрытьФорму("Обработка.мегапрайсРасширенныйПомощникПродаж.Форма",, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПомощникЗакупок(Команда)
	
	ОткрытьФорму("Обработка.мегапрайсРасширенныйПомощникЗакупок.Форма",,ЭтаФорма); 
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПомощникЗакупокПоЗаказам(Команда)
	
	ОткрытьФорму("Обработка.мегапрайсПомощникЗакупокПоЗаказамПокупателей.Форма",,ЭтаФорма); 
	
КонецПроцедуры



&НаКлиенте
Процедура ОткрытьСправочник(Команда)
	
	ОткрытьФорму("Обработка.мегапрайсУправлениеНоменклатурой.Форма",, ЭтаФорма);
	
КонецПроцедуры


&НаКлиенте
Процедура ОткрытьМарафетНоменклатуры(Команда)
	
	ОткрытьФорму("Обработка.мегапрайсМарафетНоменклатуры.Форма",, ЭтаФорма);

КонецПроцедуры


&НаКлиенте
Процедура ОткрытьРасширеннаяЗагрузка(Команда)
	
	ОткрытьФорму("Обработка.мегапрайсРасширеннаяЗагрузкаИзExcel.Форма",, ЭтаФорма);

КонецПроцедуры


&НаКлиенте
Процедура ОткрытьЗагрузкуКартинок(Команда)
	
	ОткрытьФорму("Обработка.мегапрайсЗагрузкаКартинок.Форма",, ЭтаФорма);

КонецПроцедуры


&НаКлиенте
Процедура ОткрытьАнализаторПрайсов(Команда)
	
	ОткрытьФорму("Обработка.мегапрайсАнализаторПрайсов.Форма",, ЭтаФорма);

КонецПроцедуры


&НаКлиенте
Процедура ОткрытьУстановкаЦенНоменклатуры(Команда)
	
	ОткрытьФорму("Обработка.мегапрайсПомощникУстановкиЦен.Форма",, ЭтаФорма);

КонецПроцедуры


&НаКлиенте
Процедура ОткрытьПрайсЛист(Команда)
	
	ОткрытьФорму("Справочник.мегапрайсПрайсЛисты.ФормаСписка",, ЭтаФорма);

КонецПроцедуры


&НаКлиенте
Процедура ДополнительныеОтчетыИОбработки(Команда)
	
	ОткрытьФорму("Справочник.ДополнительныеОтчетыИОбработки.ФормаСписка",, ЭтаФорма);
	
КонецПроцедуры


&НаКлиенте
Процедура ОткрытьУправлениеМегарайсом(Команда)
	
	ОткрытьФорму("ОбщаяФорма.мегапрайсНастройкаПодсистемы",, ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура НастройкаДополнительныхРеквизитов(Команда)
		 
	 ОткрытьФорму("Справочник.НаборыДополнительныхРеквизитовИСведений.Форма.ФормаСписка",,ЭтаФорма); 
	 
 КонецПроцедуры

&НаКлиенте
 Процедура УдалениеПомеченныхОбъектов(Команда)
	 
	 ОткрытьФорму("Обработка.УдалениеПомеченныхОбъектов.Форма.ОсновнаяФорма",,ЭтаФорма); 

 КонецПроцедуры

&НаКлиенте
 Процедура МониторПрайсовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	 
	СтандартнаяОбработка = Ложь;
	
	ТекущаяСтрока = Элементы.МониторПрайсов.ТекущиеДанные;
	ПоказатьЗначение(Неопределено, ТекущаяСтрока.ПрофильПрайса);

 КонецПроцедуры
